<?php
namespace custody;

/**
 * Type
 * 用于获取存管状态名称
 * 
 * @author elf <360197197@qq.com>
 * @version 1.0
 */
class Type {
    public static $list = [
        // 债权状态
        'creditState' => [
            '1' => '投标中',
            '2' => '计息中',
            '4' => '本息已返回',
            '8' => '审核中',
            '9' => '已撤销',
        ],
        'loanState' => [
            '1' => '投标中',
            '2' => '计息中',
            '3' => '到期待返还',
            '4' => '本息已返还',
            '8' => '审核中',
            '9' => '已撤销',
        ],
        'txState' => [
            'A' => '待处理',
            'C' => '撤销',
            'D' => '处理中',
            'F' => '失败',
            'S' => '成功',
        ],
    ];

    // 交易类型
    public static $tranTypes = [
        '2616' => '银联代收付渠道资金转出',
        '2780' => 'P2P融资扣款',
        '2781' => 'P2P到期还款',
        '2788' => 'P2P代偿还款',
        '2789' => 'P2P债权转让资金转出',
        '2792' => 'P2P红包发放收益扣款',
        '2793' => 'P2P平台贴息收益扣款',
        '2820' => '行内渠道资金转出、二代支付转出',
        '2831' => '(P2P债权转让资金转出',
        '2833' => '红包转出',
        '2841' => '融资扣款资金转出',
        '4616' => '转账手续费',
        '4780' => 'P2P融资扣款手续费',
        '4781' => 'P2P到期还款手续费',
        '4820' => '中间业务转出手续费',
        '5500' => '活期收益',
        '5504' => '靠档计息',
        '7616' => '银联代收付渠道资金转入',
        '7722' => '手续费入账',
        '7724' => 'P2P提现手续费转入',
        '7725' => 'P2P债权转让手续费转入',
        '7777' => '批量入账（基金分红）',
        '7780' => 'P2P融资',
        '7781' => 'P2P到期收益',
        '7782' => 'P2P账户批量充值',
        '7783' => 'P2P账户红包发放',
        '7785' => 'P2P债权转让资金转入',
        '7788' => 'P2P代偿还款到期收益',
        '7792' => 'P2P红包发放收益',
        '7793' => 'P2P平台贴息收益',
        '7820' => '行内渠道资金转入',
        '7822' => 'chinapay渠道资金转入',
        '7831' => 'P2P债权转让资金转入',
        '7833' => '红包转入',
        '7835' => '债权转让手续费转入',
        '7838' => '融资扣款资金转入',
        '7901' => '直销银行账户资金转入',
        '7905' => '直销银行账户资金转入',
        '7906' => '直销银行账户资金转入',
        '7907' => '直销银行账户资金转入',
        '7909' => '直销银行账户资金转入',
        '7910' => '直销银行账户资金转入',
        '7914' => '联动优势渠道资金转入',
        '9780' => 'P2P融资',
        '9781' => 'P2P到期收益',
        '9788' => 'P2P代偿收益',
        '9831' => 'P2P债权转让资金转入',
        '9838' => '融资扣款手续费',
    ];

    public static function getName($type, $val) {
        if(isset(self::$list[$type])) {
            $item = self::$list[$type];
            return isset($item[$val])?$item[$val]:'';
        }
        return '';
    }
}